package Logic;

import java.awt.Point;
import java.awt.Graphics;

public interface Cell {

    /**
     * Довжина сторини комірки
     */
    int SIDE_LENGTH = 20;
    /**
     * Перевірка комірки на присутність бомби
     * @return Повертає true якщо комірка містить бомбу,
     *          в іншому випадку повертає false
     */
    boolean isBomb();

    /**
     * Перевірка комірки на виявлення дії користувача
     * @return Повертає true якщо користувач позначив комірку як ту яка може містити бомбу
     *          в іншому випадку повертає false
     */
    boolean isExpected();

    /**
     * Перевірка комірки на присутність подій
     * @return Повертає true , якщо користувач перевірив комірку і вона виявилассь безпечною
     *         в іншому випадку повертає false
     */
    boolean isChecked();

    /**
     * Встановлює властивості комірки
     * @param x координата комірки по горизонталі (рахунок починається з 0)
     * @param y координата комірки по вертикалі (рахунок починається з 0)
     * @param bomb показує властивість комірки (true якщо в комірці є бомба , false в іншому випадку)
     */
    void setOptions(int x, int y, boolean bomb);

    /**
     * Встановлює бомбу в комірку
     */
    void setDanger();
    /**
     * Малює комірку
     * @param graphics графічний контекст в який малювати
     * @param x координата верхнього лівого кута комірки в пікселях
     * @param y координата верхнього лівого кута комірки в пікселях
     */
    void drawCell(Graphics graphics, int x , int y);

    /**
     * Перемальовує комірку , якщо відбулася якась подія
     * @param graphics графічний контекст в який перемальовувати
     * @param x координата верхнього лівого кута комірки в пікселях
     * @param y координата верхнього лівого кута комірки в пікселях
     */
    void redrawCell(Graphics graphics , int x, int y);

    /**
     * Для взяття кординат комірки
     * @return повертає координати комірки
     */
    Point getPlacing();

    /**
     * Встановлює властивість check в стан true , якщо відбулася подія на коміркою
     */
    void setChecked();

    /**
     * Встановлює властивість expect в стан true , якщо відбулася подія на коміркою
     */
    void setExpected();

    /**
     * Встановлює властивість check в стан false , якщо гравець відмінив стан expect
     */
    void removeCheck();

    /**
     *  Встановлює властивість expect в стан false , якщо гравець відмінив стан expect
     */
    void removeExpect();

    /**
     * Встановлює повідомлення для комірки
     * @param MSG - повідомлення яке виводиться в поточній комірці.
     *            '?' - якщо властивість expect перейшла в стан true
     *            'number' - кількість бомб поряд з поточною коміркою
     *            ' ' - якщо поряд з поточною коміркою бомб немає
     */
    void setMSG(String MSG);
}
